% 创建数据
clear
x = [11.80 14.70 15.60 16.80 17.10
18.80 19.50 20.40];
y = [30.10 17.30 16.70 13.60 11.90
10.70 8.30 6.70];
% 使用fitlm函数进行线性回归
lm = fitlm(x, y);
% 显示回归模型
disp(lm)

clear
x = [11.80 14.70 15.60 16.80 17.10 18.80 19.50 20.40];
y = [30.10 17.30 16.70 13.60 11.90 10.70 8.30 6.70];
plot(x,y,'g*') % y关于x的颜色为g的散点图
Y = y' % 构建 因变量矩阵
X=[ones(size(x,2),1),x'] % 构建 1 与 自变量 组成的矩阵
[b, bint, r, rint, s] = regress(Y,X);
% 作拟合后图像
b0 = b(1,1)
k = b(2,1)
y0 = k * x + b0 % 确定函数表达式
hold on % 保持原有散点图像
plot(x, y0)