%% 1
clear
%表达式的各项系数
a=[1 -1.232 2.23 2 4 3.792]';
%生成120组数据
X=randn(120,6); y=X*a;
%上述原始数据是成组出现的，看不到表达式
%给输入样本叠加N(0,0.5)区间的正态分布噪声
yhat=y+sqrt(0.5)*randn(120,1);
% 多元回归，b:系数估计值向量
% bint：系数估计值的95%置信区间矩阵
% r：残差向量，表示观测值与拟合值之间的差异。
% rint：残差的置信区间矩阵，用于诊断离群值。
[b,bint,r,rint]=regress(y,X,0.05)
errorbar(1:6, b, bint(:,1)-b, bint(:,2)-b)

%% 2
clear
% 给出函数形式
f = @(a,x) a(1)*exp(-a(2)*x)+a(3)*exp(-a(4)*x).*sin(a(5)*x);
% a1-a5的取值分别为：0.12,0.213, 0.54,0.17,1.23
% 给出一系列的数据101个x,101个y,最后补充了一个扰动误差
x=0:0.1:10;y=f([0.12,0.213, 0.54,0.17,1.23],x)+0.02*rand(size(x));
%非线性函数的拟合 a为估计的参数，r为残差，j为 Jacobian 矩阵
[a,r,j]=nlinfit(x,y,f,[1;1;1;1;1]);
% 给出置信区间
ci=nlparci(a,r,j);
% 参数值（一共5个）及对应的置信区间范围
errorbar(1:5,a,ci(:,1)-a,ci(:,2)-a)